# Chapter 17: Big Data - Hadoop, Spark, NoSQL, Iot

### 17.1 Introduction

**Databases**
- Relational databases: store structured data in tables with a fixed-size number of columns per row (Manipulate with SQL)
- NoSQL databases: created to handle unstructured / sem-structured data
- NewSQL databases: blend the benefits of relational and NoSQL databases

Types of NoSQL databases:
- key-value
- document
- columnar
- graph

**Apache Hadoop**
- Designed for distributed data processing with massive parallelsim among clusters of computers
- Hadoop executes tasks by bteaking them into pieces that do lots of disk I/O across many computers

**Apache Spark**
- Spark was developed as a way to perform certain big-data tasks in memory for better performance

**IoT**
- Publish/subscribe is the model that IoT and other types of applications use to connect data users with data providers

### 17.2 Relational Databases and Structured Query Language (SQL)

- A database is an integrated collection of data
- A database management system (DBMS) provides mechanisms for storing and organizing data in a manner consistent with the database's format
- Relational database management systems (RDBMSs) store data in tables and define relationships among the tables
- SQL is used almost universally with relational database systems to manipulate data and perform queries
- Most popular database systems have Python support - each typically provides a module that adheres to Python's Database Application Programming Interface (DB-API)

Popular open-source RDBMSs:
- SQLite
- PostgreSQL
- MariaDB
- MySQL

Proprietary RDBMSs:
- Microsoft SQL Server
- Oracle
- Sybase
- IBM Db2

**Tables, Rows, and Columns**
- Tables are comprised of rows
- Rows are comprised of columns
- Primary key: a column with a value that's unique for each row
- Rows are unique (by primary key) within a table, but particular column values may be duplicated between rows

### 17.2.1 A books Database

In [1]:
# Connecting to the database in python

import sqlite3

connection = sqlite3.connect('books.db')

**authors Table**
- The authors table stores all the authors and has three columns: 'id', 'first', 'last'

**Viewing the authors Table's contents**
- The pandas function read_sql executes a SQL query and returns a DataFrame containing the query's results
- read_sql arguments: a string representing the SQL query to execute, the SQLite database's Connection object, an index_col keyword argument indicating which column should be used as the DataFrame's row indices
- when index_col keyword is not passed, index values starting from 0 appear to the left of the DataFrame's rows

In [2]:
import pandas as pd

pd.options.display.max_columns = 10

pd.read_sql('SELECT * FROM authors', connection, index_col=['id'])

# A SQL SELECT query gets rows and columns from one or more tables in a db
# the * is a wildcard indicating that the query should get all columns from the authors table

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

**titles table**
- The titles table stores all the books and has four columns: 'isbn', 'title', 'edition', 'copyright'

In [3]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

**author_ISBN Table**
- id: An author's id (an integer)
- isbn: The book's ISBN (a string)
- The id column is a foreign key (a column in this table mataches a primary key column in another table)
- Together the id and isbn columns in this table form a composite primary key

In [4]:
# View the first five rows

df = pd.read_sql('SELECT * FROM author_ISBN', connection)

df.head()

   id        isbn
0   1  0134289366
1   2  0134289366
2   5  0134289366
3   1  0135404673
4   2  0135404673

**Rule of Referential Integrity**: Every foreign-key value must appear as the primary-key value in a row of another table so the DBMS can ensure that the foreign-key value is valid
- Foreign keys also allow related data in multiple tables to be selected from those tables and combined (joining the data)
- There is a one-to-many relationship between a primary key and a corresponding foreign key
- A foreign key can appear many times in its table but only once (as a primary key) in another table

**Rule of Entity Integrity:** Every row must have a primary-key value, and that value must be unique in the table

**SQL Keyworks**
- **SELECT** retrieves data from one or more tables
- **FROM** indicates the tables involved in the query (required in every SELECT)
- **WHERE** indicates the criteria for selection that determine the rows to be retrieved, deleted or updated (optional in SQL statements)
- **GROUP BY** indicates criteria for grouping rows (optional)
- **ORDER BY** indicates criteria for ordering rows (optional)
- **INNER JOIN** merges rows from multiple tables
- **INSERT**: insert rows into a specified table
- **UPDATE**: update rows in a specified table
- **DELETE**: delete rows from a specified table

### 17.2.2 SELECT Queries
- To retrieve only specific columns, specify a comma-separated list of column names

In [5]:
pd.read_sql('SELECT first, last FROM authors', connection)

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

### 17.2.3 WHERE Clause
- SQL's WHERE clause specifies a query's selection criteria
- String values in SQL queries are delimited by single (') quotes

In [6]:
pd.read_sql("""SELECT title, edition, copyright FROM titles WHERE copyright > '2016'""", connection)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

**Pattern matching: Zero or more characters**
- Operator LIKE is used for pattern matching
- A pattern that contains the percent (%) wildcard character searches for strings that have zero or more characters at the percent character's position in the pattern

In [7]:
pd.read_sql("""SELECT id, first, last 
                FROM authors 
                WHERE last LIKE 'D%'""",
            connection, index_col=['id'])

     first    last
id
1     Paul  Deitel
2   Harvey  Deitel
3    Abbey  Deitel

**Pattern matching: any character**
- An underscore in the pattern string indicates a single wildcard character at that position

In [8]:
pd.read_sql("""SELECT id, first, last
                FROM authors
                WHERE first LIKE '_b%'""",
            connection, index_col=['id'])

    first    last
id
3   Abbey  Deitel

### 17.2.4 ORDER BY Clause
- ORDER BY sorts a query's results into ascending order or descending order specified with ASC and DESC respectively
- The default order is ascending (ASC is optional)

In [9]:
pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

**Sorting by multiple columns**
- Specify a comma-separated list of column names after the ORDER BY keywords
- The sorting order can vary by column

In [10]:
pd.read_sql("""SELECT id, first, last
                FROM authors
                ORDER BY last, first""",
            connection, index_col=['id'])

        first    last
id
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [11]:
pd.read_sql("""SELECT id, first, last
                FROM authors
                ORDER BY last DESC, first ASC""",
            connection, index_col=['id'])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

**Combining the WHERE and ORDER BY Clauses**

In [12]:
pd.read_sql("""SELECT isbn, title, edition, copyright
                FROM titles
                WHERE title LIKE '%How to Program'
                ORDER BY title""",
            connection)

         isbn                             title  edition copyright
0  0134444302            Android How to Program        3      2017
1  0133976890                  C How to Program        8      2016
2  0134448235                C++ How to Program       10      2017
3  0132151006     Internet & WWW How to Program        5      2012
4  0134743350               Java How to Program       11      2018
5  0133406954  Visual Basic 2012 How to Program        6      2014
6  0134601548          Visual C# How to Program        6      2017
7  0136151574         Visual C++ How to Program        2      2008

### 17.2.5 Merging Data from Multiple Tables: INNER JOIN

In [13]:
pd.read_sql("""SELECT first, last, isbn
                FROM authors
                INNER JOIN author_ISBN
                    ON authors.id = author_ISBN.id
                ORDER BY last, first""",
            connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

### 17.2.6 INSERT INTO Statement
- To modify the database, use a sqlite3 Cursor object, which you obtain by calling the Connection's cursor method
- INSERT INTO inserts a row into a talbe
- The Cursor method execute executes its SQL argument and returns the Cursor
- The VALUES provided must match the column names specified both in order and type
- We do not specify a vlue for the id column because it's an autoincremented column in the authors table

In [16]:
cursor = connection.cursor()

cursor = cursor.execute("""INSERT INTO authors (first, last)
                            VALUES ('Sue', 'Red')""")

pd.read_sql('SELECT id, first, last FROM authors', connection, index_col =['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red
7         Sue     Red

**Note regarding strings that contain single quotes**
- A string containing a single quote, such as O'Malley, must have two single quotes in the position where the single quote appears (O''Malley)
- The first acts as an escape character for the second

### 17.2.7 UPDATE Statement
- An UPDATE statement modifies existing values
- For statements that modify the database, the Cursor object's rowcount attribute contains an integer value representing the number of rows that were modified

In [18]:
cursor = cursor.execute("""UPDATE authors SET last='Black'
                            WHERE last='Red' AND first='Sue'""") # We could have specified a row using WHERE id=6

In [19]:
cursor.rowcount

2

In [21]:
pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue   Black
7         Sue   Black

### 17.2.8 DELETE FROM Statement
- The optional WHERE clause determines which rows to delete
- If WHERE is omitted, all the table's fows are deleted

In [23]:
cursor = cursor.execute('DELETE FROM authors WHERE id=6 OR id=7')

cursor.rowcount

2

In [24]:
pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

**Closing the database**
- When you no longer need access to the database, you chould call the Connection's close method to disonnect from the database
- connection.close()

### 17.2 Self Check

In [29]:
pd.read_sql("""SELECT title, edition
                FROM titles
                ORDER BY edition DESC""",
            connection).head(3)

                 title  edition
0  Java How to Program       11
1   C++ How to Program       10
2     C How to Program        8

In [30]:
pd.read_sql("""SELECT id, first, last
                FROM authors
                WHERE first LIKE 'A%'""",
            connection, index_col=['id'])

        first    last
id
3       Abbey  Deitel
5   Alexander    Wald

In [31]:
pd.read_sql("""SELECT title 
                FROM titles
                WHERE title NOT LIKE '%How to Program'""",
            connection)

                           title
0  Intro to Python for CS and DS
1      Android 6 for Programmers